{"id": "AG-FR-001", "scenario_id": "SCN-FR-001", "language": "FR", "expected_elements": ["Description des tâches principales de la journée", "Mention des réunions ou collaborations", "Référence à l'horaire ou à la routine"], "recommended_structures": ["Présent de l'indicatif", "Expressions de temps (le matin, l'après-midi, etc.)"], "common_pitfalls": ["Oublier d'utiliser le présent", "Rester trop vague sur les tâches"], "model_answer_outline": "Je commence ma journée en lisant mes courriels et en planifiant mes tâches. Ensuite, j'assiste souvent à une réunion avec mon équipe. Je travaille sur mes dossiers et je réponds aux questions du public. L'après-midi, je fais des suivis et je prépare des rapports."}
{"id": "AG-FR-002", "scenario_id": "SCN-FR-002", "language": "FR", "expected_elements": ["Nom de l'équipe ou du service", "Nombre de membres", "Bref rôle ou fonction de l'équipe"], "recommended_structures": ["Présent de l'indicatif", "Structures pour décrire (mon équipe s'appelle..., il y a...)"], "common_pitfalls": ["Oublier de donner le nom exact", "Confondre le nombre de personnes"], "model_answer_outline": "Mon équipe s'appelle l'équipe des services à la clientèle. Nous sommes huit personnes dans l'équipe. Nous aidons les citoyens avec leurs demandes d'information."}
{"id": "AG-FR-003", "scenario_id": "SCN-FR-003", "language": "FR", "expected_elements": ["Moyens de communication utilisés (courriel, téléphone, réunions, etc.)", "Fréquence ou contexte d'utilisation", "Exemple d'une situation typique"], "recommended_structures": ["Présent de l'indicatif", "Utilisation des verbes communiquer, envoyer, parler"], "common_pitfalls": ["Oublier de mentionner plusieurs moyens", "Utiliser le mauvais temps verbal"], "model_answer_outline": "Je communique surtout avec mes collègues par courriel pour partager des documents. Nous avons aussi des réunions virtuelles chaque semaine. Parfois, j'utilise le téléphone pour des questions urgentes."}
{"id": "AG-FR-004", "scenario_id": "SCN-FR-004", "language": "FR", "expected_elements": ["Description du service fourni", "Public cible (citoyens, entreprises, etc.)", "Importance ou utilité du service"], "recommended_structures": ["Présent de l'indicatif", "Structures passives ou impersonnelles (on aide, on fournit)"], "common_pitfalls": ["Être trop général ou vague", "Ne pas identifier le public"], "model_answer_outline": "Mon équipe fournit de l'information sur les programmes gouvernementaux aux citoyens. Nous répondons à leurs questions par téléphone et par courriel. Ce service aide le public à mieux comprendre leurs options."}
{"id": "AG-FR-005", "scenario_id": "SCN-FR-005", "language": "FR", "expected_elements": ["Liste d'au moins deux outils technologiques", "Description brève de leur usage", "Lien avec les tâches quotidiennes"], "recommended_structures": ["Présent de l'indicatif", "Utilisation de 'j'utilise', 'je me sers de'"], "common_pitfalls": ["Oublier de donner des exemples concrets", "Confondre le vocabulaire technologique"], "model_answer_outline": "J'utilise chaque jour mon ordinateur portable pour accéder à mes courriels et à mes dossiers. J'utilise aussi Microsoft Teams pour les réunions et les discussions avec mon équipe."}
{"id": "AG-FR-006", "scenario_id": "SCN-FR-006", "language": "FR", "expected_elements": ["Mention d'une pratique écologique au bureau", "Exemple concret", "Lien avec l'environnement"], "recommended_structures": ["Présent de l'indicatif", "Utilisation de l'expression 'faire attention à'"], "common_pitfalls": ["Rester trop général (ex: juste dire oui/non)", "Ne pas donner d'exemple précis"], "model_answer_outline": "Oui, je fais attention à l'environnement au bureau. Par exemple, j'imprime seulement quand c'est nécessaire et je recycle le papier. J'essaie aussi d'éteindre mon ordinateur en fin de journée."}
{"id": "AG-FR-007", "scenario_id": "SCN-FR-007", "language": "FR", "expected_elements": ["Indication claire du projet en cours", "Objectif ou but du projet", "Tâches principales ou état d'avancement"], "recommended_structures": ["Présent de l'indicatif", "Utilisation de 'je travaille sur', 'nous développons'"], "common_pitfalls": ["Oublier de préciser le projet", "Ne pas expliquer le but"], "model_answer_outline": "En ce moment, je travaille sur un projet pour améliorer notre site web. Le but est de faciliter l'accès à l'information pour les citoyens. Je participe à la rédaction des contenus et aux réunions de suivi."}
{"id": "AG-FR-008", "scenario_id": "SCN-FR-008", "language": "FR", "expected_elements": ["Moyen de transport principal (auto, transport en commun, vélo, à pied, etc.)", "Durée ou fréquence", "Raison de ce choix si possible"], "recommended_structures": ["Présent de l'indicatif", "Expressions de temps (chaque jour, le matin, environ...)"], "common_pitfalls": ["Oublier de mentionner la fréquence", "Confondre les moyens de transport"], "model_answer_outline": "Chaque jour, je vais au travail en autobus parce que c'est pratique et écologique. Le trajet dure environ trente minutes. Parfois, je marche si le temps le permet."}
{"id": "AG-FR-009", "scenario_id": "SCN-FR-009", "language": "FR", "expected_elements": ["Résumé des informations clés du message vocal", "Actions à prendre ou suivis requis", "Identification du ou des interlocuteurs principaux"], "recommended_structures": ["Structures pour rapporter l'information (il a dit que..., on a demandé de...)", "Utilisation du futur proche ou du conditionnel pour les actions à venir"], "common_pitfalls": ["Oublier un point important du message", "Ne pas préciser les actions à prendre"], "model_answer_outline": "Le message vocal annonce un changement dans le calendrier du projet. On nous demande de mettre à jour nos dossiers et de communiquer avec l'équipe d'ici vendredi. Je dois donc informer mes collègues et préparer un rapport de suivi."}
{"id": "AG-FR-010", "scenario_id": "SCN-FR-010", "language": "FR", "expected_elements": ["Raison exacte du report de la réunion", "Prochaines étapes ou nouvelle date proposée", "Personnes concernées ou impliquées"], "recommended_structures": ["Passé composé pour expliquer la raison", "Futur ou impératif pour les étapes suivantes"], "common_pitfalls": ["Ne pas mentionner la raison du report", "Oublier les prochaines étapes"], "model_answer_outline": "La réunion est reportée parce que l'un des membres clés est absent pour des raisons personnelles. La nouvelle date sera communiquée sous peu. D'ici là, il faut préparer les documents demandés et rester disponible pour un suivi."}
{"id": "AG-FR-011", "scenario_id": "SCN-FR-011", "language": "FR", "expected_elements": ["Résumé des changements principaux dans la politique de télétravail", "Explication des implications pour les employés", "Mention des nouvelles attentes ou procédures"], "recommended_structures": ["Utilisation du présent et du futur simple pour décrire les changements", "Emploi des structures causales (parce que, donc, puisque)"], "common_pitfalls": ["Oublier de mentionner les répercussions concrètes pour les employés", "Faire un résumé trop vague ou incomplet"], "model_answer_outline": "La nouvelle politique permet aux employés de travailler à distance trois jours par semaine, au lieu de deux. Cela implique que les employés devront s'assurer que leur équipement est fonctionnel à la maison et participer à plus de réunions virtuelles. Le personnel devra également informer leur gestionnaire de leur horaire hebdomadaire."}
{"id": "AG-FR-012", "scenario_id": "SCN-FR-012", "language": "FR", "expected_elements": ["Le type de formation annoncée", "La date et l'heure de la formation", "Les actions requises de la part de l'employé"], "recommended_structures": ["Utilisation du passé composé pour résumer le message entendu", "Utilisation de l'infinitif pour donner des instructions"], "common_pitfalls": ["Confondre la date ou l'heure de la formation", "Oublier de préciser ce qu'il faut faire pour s'inscrire ou participer"], "model_answer_outline": "Il s'agit d'une formation sur la sécurité informatique qui aura lieu le 15 juin à 13h. Je dois confirmer ma présence par courriel avant la fin de la semaine et apporter mon ordinateur portable le jour de la formation."}
{"id": "AG-FR-013", "scenario_id": "SCN-FR-013", "language": "FR", "expected_elements": ["Quand l’interruption de service aura lieu", "Pourquoi le service sera interrompu", "Quelles mesures doivent être prises par les employés"], "recommended_structures": ["Utilisation du futur proche et des compléments de temps", "Utilisation de l'impératif pour indiquer les mesures"], "common_pitfalls": ["Négliger de mentionner la raison de l’interruption", "Oublier de donner les conseils ou mesures à prendre"], "model_answer_outline": "Le service sera interrompu le mercredi 10 mai de 18h à 22h pour une maintenance du système. Les employés doivent sauvegarder leur travail et se déconnecter avant 18h. Il est recommandé de planifier les tâches importantes en dehors de cette période."}
{"id": "AG-FR-014", "scenario_id": "SCN-FR-014", "language": "FR", "expected_elements": ["Description de l’initiative environnementale", "Les objectifs visés", "Actions attendues de la part du personnel"], "recommended_structures": ["Utilisation du présent et du futur pour exprimer les objectifs et les attentes", "Emploi des structures de but (afin de, pour que)"], "common_pitfalls": ["Oublier de préciser ce que le personnel doit faire concrètement", "Ne pas mentionner l'objectif principal de l’initiative"], "model_answer_outline": "L’initiative vise à réduire la consommation de papier au bureau de 30 % d’ici la fin de l’année. Les employés doivent utiliser des documents électroniques et éviter d’imprimer sauf si c’est nécessaire. L’objectif est de protéger l’environnement et de diminuer les coûts liés au papier."}
{"id": "AG-FR-015", "scenario_id": "SCN-FR-015", "language": "FR", "expected_elements": ["La modification qui doit être faite", "La personne responsable de la modification", "Le délai à respecter"], "recommended_structures": ["Utilisation du passif pour indiquer la responsabilité (La modification sera faite par…)", "Utilisation de devoir + infinitif pour exprimer l’obligation"], "common_pitfalls": ["Ne pas spécifier qui s’occupe de la tâche", "Oublier le délai ou la date limite"], "model_answer_outline": "Il faut modifier la date de la réunion dans le calendrier partagé. C’est Julie qui s’en occupe et elle doit faire le changement avant vendredi midi."}
{"id": "AG-FR-016", "scenario_id": "SCN-FR-016", "language": "FR", "expected_elements": ["Description d’un projet dirigé pour améliorer la communication interne", "Exemples de difficultés rencontrées", "Méthodes de gestion ou solutions apportées"], "recommended_structures": ["Utilisation du passé composé et de l’imparfait pour raconter l’expérience", "Emploi de structures pour exprimer la cause et la conséquence"], "common_pitfalls": ["Rester trop vague sur la description du projet", "Oublier de mentionner comment les difficultés ont été surmontées"], "model_answer_outline": "J’ai dirigé la mise en place d’une infolettre interne mensuelle pour mieux informer le personnel. Nous avons eu des difficultés à recueillir les contributions de chaque section, alors j’ai organisé des rencontres régulières et fixé des échéanciers clairs. Grâce à cette approche, la communication s’est améliorée dans l’équipe."}
{"id": "AG-FR-017", "scenario_id": "SCN-FR-017", "language": "FR", "expected_elements": ["Description du problème inattendu rencontré par l’équipe", "Solutions proposées par le candidat", "Résultat ou impact des solutions"], "recommended_structures": ["Utilisation de l’imparfait et du passé composé pour décrire la situation", "Emploi du conditionnel pour exprimer des solutions alternatives"], "common_pitfalls": ["Ne pas expliquer clairement le problème", "Oublier de décrire l’impact des solutions"], "model_answer_outline": "Notre équipe a fait face à un problème technique avec un nouveau logiciel. J’ai proposé d’organiser une séance de formation rapide et de créer un guide d’utilisation. Grâce à ces mesures, nous avons pu terminer le projet à temps."}
{"id": "AG-FR-018", "scenario_id": "SCN-FR-018", "language": "FR", "expected_elements": ["Description de l’impact de la politique de télétravail sur l’équipe", "Avantages observés", "Inconvénients ou défis rencontrés"], "recommended_structures": ["Utilisation du présent pour décrire la situation actuelle", "Utilisation de 'il y a', 'cela a permis', 'cependant'"], "common_pitfalls": ["Oublier d’équilibrer les points positifs et négatifs", "Faire des généralisations sans exemples concrets"], "model_answer_outline": "La nouvelle politique a permis plus de flexibilité et une meilleure conciliation travail-vie personnelle. Cependant, la collaboration en équipe est parfois plus difficile à distance. Nous avons mis en place des réunions virtuelles régulières pour rester connectés."}
{"id": "AG-FR-019", "scenario_id": "SCN-FR-019", "language": "FR", "expected_elements": ["Description du processus d’intégration des nouveaux employés", "Exemples de défis culturels rencontrés", "Solutions ou adaptations mises en place"], "recommended_structures": ["Utilisation du passé composé pour décrire les actions entreprises", "Emploi des expressions de comparaison et de contraste"], "common_pitfalls": ["Ne pas donner d’exemple de défi culturel", "Oublier de décrire comment les défis ont été surmontés"], "model_answer_outline": "Nous avons accueilli trois nouveaux employés de différentes régions du pays. Certains avaient des habitudes de travail différentes, ce qui a causé quelques malentendus. J’ai organisé des séances d’échange pour favoriser la compréhension mutuelle et faciliter leur intégration."}
{"id": "AG-FR-020", "scenario_id": "SCN-FR-020", "language": "FR", "expected_elements": ["Description de la participation du candidat à la mise en place d’un service", "Identification des étapes clés du projet", "Mention des collaborations ou ressources nécessaires"], "recommended_structures": ["Utilisation du passé composé pour les actions réalisées", "Emploi de connecteurs temporels (d’abord, ensuite, enfin)"], "common_pitfalls": ["Oublier de décrire les étapes clés", "Ne pas préciser sa propre contribution"], "model_answer_outline": "J’ai participé à la création d’un nouveau service en ligne pour les citoyens. D’abord, nous avons consulté les utilisateurs, puis développé la plateforme et enfin lancé une campagne d’information. J’étais responsable de la coordination entre les équipes techniques et le service à la clientèle."}
{"id": "AG-FR-021", "scenario_id": "SCN-FR-021", "language": "FR", "expected_elements": ["Description du nouvel outil technologique adopté", "Présentation des avantages pour l’équipe", "Présentation des défis rencontrés et solutions apportées"], "recommended_structures": ["Utilisation du passé composé et de l’imparfait pour raconter les événements", "Expressions pour comparer (par exemple : d’une part… d’autre part…)"], "common_pitfalls": ["Oublier de parler à la fois des avantages et des défis", "Manquer de clarté dans la description de l’outil ou des impacts"], "model_answer_outline": "L’apprenant présente brièvement l’outil technologique adopté (exemple : une nouvelle plateforme de gestion). Il explique les avantages principaux (efficacité, collaboration accrue), mentionne les défis rencontrés (résistance au changement, formation nécessaire) et indique comment ceux-ci ont été surmontés."}
{"id": "AG-FR-022", "scenario_id": "SCN-FR-022", "language": "FR", "expected_elements": ["Description de l’initiative environnementale", "Objectifs visés par l’initiative", "Résultats obtenus et impact sur l’équipe ou l’organisation"], "recommended_structures": ["Utilisation du passé composé pour rapporter les actions", "Expressions de cause et de conséquence (par exemple : grâce à, cela a permis de...)"], "common_pitfalls": ["Ne pas préciser les résultats ou les effets concrets", "Oublier de relier l’initiative aux objectifs de l’équipe"], "model_answer_outline": "L’apprenant décrit une initiative (comme la réduction des déchets de bureau), explique son but, et détaille les résultats (diminution des déchets, sensibilisation accrue). Il souligne l’impact positif sur l’équipe et l’organisation."}
{"id": "AG-FR-023", "scenario_id": "SCN-FR-023", "language": "FR", "expected_elements": ["Description brève de l’atelier organisé", "Objectifs visés pour la communication interne", "Leçons tirées ou améliorations constatées"], "recommended_structures": ["Utilisation du passé composé pour raconter le déroulement", "Expressions pour exprimer les leçons apprises (par exemple : j’ai constaté que..., il s’est avéré que...)"], "common_pitfalls": ["Ne pas mentionner les leçons apprises ou les résultats", "Rester trop vague sur le contenu ou le déroulement de l’atelier"], "model_answer_outline": "L’apprenant explique comment l’atelier s’est déroulé (participation, activités), indique les objectifs visés (améliorer la clarté de la communication), puis partage les leçons tirées (importance de l’écoute, nécessité d’outils adaptés)."}
{"id": "AG-FR-024", "scenario_id": "SCN-FR-024", "language": "FR", "expected_elements": ["Identification des besoins des deux directions", "Proposition d’un compromis concret", "Justification de la solution en tenant compte des contraintes budgétaires"], "recommended_structures": ["Utilisation du conditionnel pour présenter des solutions hypothétiques", "Expressions pour négocier (par exemple : il serait envisageable de..., afin de satisfaire...)"], "common_pitfalls": ["Proposer une solution irréaliste au regard du budget", "Ignorer l’un des besoins ou ne pas justifier le compromis"], "model_answer_outline": "L’apprenant identifie les attentes de chaque direction, propose un compromis (partage des ressources, échéancier ajusté), et explique en quoi cette solution respecte le budget tout en assurant l’acceptation des deux parties."}
{"id": "AG-FR-025", "scenario_id": "SCN-FR-025", "language": "FR", "expected_elements": ["Présentation claire du projet et de ses bénéfices", "Anticipation des préoccupations du comité", "Arguments pour rassurer et convaincre"], "recommended_structures": ["Utilisation du subjonctif pour exprimer la nécessité ou la valeur", "Structures argumentatives (par exemple : premièrement..., de plus..., enfin...)"], "common_pitfalls": ["Négliger d’anticiper des objections concrètes", "Ne pas structurer les arguments de façon logique"], "model_answer_outline": "L’apprenant présente le projet, énumère ses bénéfices (efficience, alignement stratégique), prévoit les inquiétudes possibles (coûts, risques) et propose des réponses convaincantes pour rassurer le comité."}
{"id": "AG-FR-026", "scenario_id": "SCN-FR-026", "language": "FR", "expected_elements": ["Reconnaissance des causes du climat négatif", "Proposition de mesures pour rétablir la confiance", "Recherche d’une solution inclusive"], "recommended_structures": ["Utilisation de la voix passive pour l’objectivité", "Emploi de tournures pour impliquer tous les acteurs (par exemple : il serait important que chacun...; nous devrions...)"], "common_pitfalls": ["Négliger l’aspect humain ou émotionnel", "Proposer des mesures trop vagues ou génériques"], "model_answer_outline": "L’apprenant identifie les sources de tension (communication, conflits), propose un dialogue ouvert ou une médiation, et recommande des actions concrètes (réunions régulières, clarification des rôles) pour restaurer un climat positif."}
{"id": "AG-FR-027", "scenario_id": "SCN-FR-027", "language": "FR", "expected_elements": ["Présentation claire de la politique", "Arguments pour démontrer sa pertinence", "Stratégies pour persuader les collègues"], "recommended_structures": ["Utilisation de l’infinitif pour exprimer des objectifs", "Emploi de phrases persuasives (par exemple : il est essentiel de..., cette politique permettra de...)"], "common_pitfalls": ["Ne pas expliquer les bénéfices concrets pour les collègues", "Être trop directif sans chercher l’adhésion"], "model_answer_outline": "L’apprenant explique la politique (objectifs, impacts), met en avant ses avantages (amélioration des conditions, conformité réglementaire), et utilise des arguments adaptés pour motiver l’adhésion des collègues."}
{"id": "AG-FR-028", "scenario_id": "SCN-FR-028", "language": "FR", "expected_elements": ["Présentation des fonctionnalités du nouvel outil", "Identification des enjeux liés à la protection des données", "Proposition de mesures concrètes pour garantir la sécurité"], "recommended_structures": ["Utilisation du futur pour décrire des mesures à mettre en place", "Emploi du conditionnel pour proposer des solutions"], "common_pitfalls": ["Négliger l’aspect confidentiel ou légal des données", "Manquer de précision dans les mesures proposées"], "model_answer_outline": "L’apprenant présente brièvement le nouvel outil, explique pourquoi la protection des données est cruciale, et propose des mesures concrètes (formation, contrôles d’accès, cryptage) pour en assurer la sécurité."}
{"id": "AG-FR-029", "scenario_id": "SCN-FR-029", "language": "FR", "expected_elements": ["Présentation de mesures concrètes pour favoriser l’inclusion", "Justification de chaque mesure (bénéfices attendus, alignement avec les valeurs de la fonction publique)", "Référence à la diversité et à l’équité"], "recommended_structures": ["Utilisation du conditionnel pour recommander", "Expressions pour justifier (par exemple : afin de..., cela permettrait de...)"], "common_pitfalls": ["Rester trop général sans exemples précis", "Oublier de justifier les recommandations"], "model_answer_outline": "L’apprenant recommande des actions (formations à la diversité, adaptation des processus de recrutement), explique les bénéfices pour l’équipe et la fonction publique, et justifie chaque mesure en lien avec l’équité et l’inclusion."}
{"id": "AG-FR-030", "scenario_id": "SCN-FR-030", "language": "FR", "expected_elements": ["Présentation claire de la nouvelle stratégie de communication", "Arguments convaincants pour son adoption", "Adaptation du discours aux besoins des ministères"], "recommended_structures": ["Utilisation de structures pour donner des exemples (par exemple : notamment..., par exemple...)", "Emploi du subjonctif pour exprimer la finalité ou l’importance"], "common_pitfalls": ["Ne pas adapter le message selon les ministères visés", "Manquer d’arguments concrets pour convaincre"], "model_answer_outline": "L’apprenant présente les grandes lignes de la stratégie (objectifs, outils), met en avant les bénéfices (meilleure coordination, visibilité accrue), et adapte ses arguments en fonction des besoins spécifiques des ministères pour encourager leur adhésion."}
{"id": "AG-EN-001", "scenario_id": "SCN-EN-001", "language": "EN", "expected_elements": ["Mention of main daily work tasks", "Reference to role in the office", "Simple description of routine activities"], "recommended_structures": ["Present simple tense (e.g., I answer emails, I attend meetings)", "Sequencing words (first, then, finally)"], "common_pitfalls": ["Using the wrong tense (e.g., past instead of present)", "Not mentioning specific responsibilities"], "model_answer_outline": "The answer should list the main tasks done each day, such as checking emails, helping clients, or preparing documents. It should indicate the person's role. The answer should use clear, simple sentences in the present tense."}
{"id": "AG-EN-002", "scenario_id": "SCN-EN-002", "language": "EN", "expected_elements": ["Statement about working on a project", "Brief description of the project", "Mention of a task or goal for the project"], "recommended_structures": ["Present continuous tense (e.g., I am working on...)", "Short descriptive sentences"], "common_pitfalls": ["Forgetting to mention the project topic", "Using past tense instead of present continuous"], "model_answer_outline": "The response should state if the person is working on a project now, briefly describe what the project is, and mention what the project aims to achieve or their role in it. Sentences should be simple and direct."}
{"id": "AG-EN-003", "scenario_id": "SCN-EN-003", "language": "EN", "expected_elements": ["Mention of an office policy", "Explanation of the policy's purpose", "Short example or reason for its importance"], "recommended_structures": ["Present simple tense (e.g., We have a policy that... )", "Because/so to explain reasons"], "common_pitfalls": ["Not explaining what the policy is for", "Being too vague or general"], "model_answer_outline": "The answer should state one office policy, explain briefly why it's important or what it is for, and, if possible, give a short example of how it is used."}
{"id": "AG-EN-004", "scenario_id": "SCN-EN-004", "language": "EN", "expected_elements": ["Description of team size", "Mention of roles or what the team does", "Reference to team dynamics or working together"], "recommended_structures": ["There is/are (e.g., There are five people on my team)", "Present simple tense"], "common_pitfalls": ["Not mentioning the number of people or roles", "Not describing how the team works together"], "model_answer_outline": "The answer should describe the number of team members, mention some of their roles or what the team is responsible for, and briefly touch on how they work together."}
{"id": "AG-EN-005", "scenario_id": "SCN-EN-005", "language": "EN", "expected_elements": ["Mention of a specific service provided", "Who receives the service (e.g., the public, other departments)", "Simple explanation of what the service does"], "recommended_structures": ["Present simple tense (We provide..., Our office helps...)", "Who/what/why sentences"], "common_pitfalls": ["Naming a service without explaining it", "Giving a service not relevant to the Canadian federal context"], "model_answer_outline": "The answer should state one service the office provides, explain briefly who the service is for, and describe what the service helps with, using clear sentences."}
{"id": "AG-EN-006", "scenario_id": "SCN-EN-006", "language": "EN", "expected_elements": ["Mention of at least one technology/tool used", "Description of how it is used in daily tasks", "Reason for using it"], "recommended_structures": ["Present simple tense (I use..., We use...)", "Purpose phrases (to + verb, for + noun/gerund)"], "common_pitfalls": ["Not mentioning how the technology is used", "Using only brand names without context"], "model_answer_outline": "The answer should mention a piece of technology or software used at work, explain how it is used in daily work, and give a reason or example of its purpose."}
{"id": "AG-EN-007", "scenario_id": "SCN-EN-007", "language": "EN", "expected_elements": ["Description of transportation method", "Frequency or routine (every day, usually)", "Brief mention of reason or detail (e.g., why this method is used)"], "recommended_structures": ["Present simple tense (I take the bus)", "Adverbs of frequency (usually, always, sometimes)"], "common_pitfalls": ["Not saying how often they use the method", "Incorrect verb forms"], "model_answer_outline": "The answer should say how the person gets to the office (e.g., bus, car, bike), how often or usually, and if possible, why they choose this method."}
{"id": "AG-EN-008", "scenario_id": "SCN-EN-008", "language": "EN", "expected_elements": ["Mention of at least one communication method (e.g., email, meetings)", "Description of when or why it is used", "Reference to team interaction"], "recommended_structures": ["Present simple (We talk using..., I communicate with my team by...)", "When/why clauses"], "common_pitfalls": ["Listing tools without describing their use", "Not mentioning teamwork or interaction"], "model_answer_outline": "The answer should mention a method of communication with the team, describe when or why it is used, and refer to working or interacting with the team."}
{"id": "AG-EN-009", "scenario_id": "SCN-EN-009", "language": "EN", "expected_elements": ["Summary of main points from the voicemail", "Identification of the required action", "Who needs to do the action (if stated)"], "recommended_structures": ["Reported speech (e.g., The caller said that...)", "Modal verbs for necessity (need to, should)"], "common_pitfalls": ["Missing the main action required", "Repeating the voicemail word-for-word instead of summarizing"], "model_answer_outline": "The answer should summarize the content of the voicemail in a few sentences, clearly state what needs to be done next, and, if specified, who is responsible for the action."}
{"id": "AG-EN-010", "scenario_id": "SCN-EN-010", "language": "EN", "expected_elements": ["Summary of the discussion between project managers", "Identification of key points or decisions", "Clear statement of the next required action"], "recommended_structures": ["Past tense to summarize discussion (They discussed...)", "Passive or imperative forms for next steps (It was decided that..., The next step is to...)"], "common_pitfalls": ["Omitting the required action", "Listing all details instead of summarizing main points"], "model_answer_outline": "The answer should briefly summarize what the project managers talked about, mention any key decisions or points, and clearly state what needs to be done next."}
{"id": "AG-EN-011", "scenario_id": "SCN-EN-011", "language": "EN", "expected_elements": ["Summary of the key updates mentioned in the voicemail", "Explanation of what actions are expected from employees", "Reference to any deadlines or specific instructions"], "recommended_structures": ["Passive voice for instructions (e.g., 'Employees are expected to...')", "Sequencing connectors (e.g., 'First', 'Then', 'Finally')"], "common_pitfalls": ["Missing some of the key updates", "Failing to clearly explain the instructions for employees"], "model_answer_outline": "Summarize the main updates announced in the voicemail, such as changes to schedules, procedures, or policies. Clearly explain what employees need to do as a result of these updates. Mention any important dates or steps to follow."}
{"id": "AG-EN-012", "scenario_id": "SCN-EN-012", "language": "EN", "expected_elements": ["Main points of the HR message", "Instructions on how staff can sign up for training", "Any relevant deadlines or requirements"], "recommended_structures": ["Imperative forms for instructions (e.g., 'Please complete...')", "Conditional sentences (e.g., 'If you wish to participate, you must...')"], "common_pitfalls": ["Overlooking important details about the training", "Not providing clear steps for registration"], "model_answer_outline": "Summarize the purpose and key details of the HR message, such as the type of training being offered and its importance. Explain how staff members can sign up, including any forms or online systems to use, and highlight any registration deadlines."}
{"id": "AG-EN-013", "scenario_id": "SCN-EN-013", "language": "EN", "expected_elements": ["Summary of the problem discussed", "Actions that will be taken to resolve the issue", "Who is responsible for taking those actions"], "recommended_structures": ["Past simple and future tenses (e.g., 'The issue occurred...', 'We will take steps...')", "Passive voice (e.g., 'The problem will be addressed by...')"], "common_pitfalls": ["Failing to clearly identify the problem", "Not specifying what will be done to resolve it"], "model_answer_outline": "Briefly describe the problem that was discussed, such as a system failure or process issue. Outline the steps that will be taken to fix the problem and specify who will be responsible for these actions."}
{"id": "AG-EN-014", "scenario_id": "SCN-EN-014", "language": "EN", "expected_elements": ["Description of the main change to the recycling program", "Explanation of what employees need to do differently", "Mention of any new procedures or requirements"], "recommended_structures": ["Present simple and modal verbs (e.g., 'Employees must now...', 'The program now includes...')", "Sequencing for instructions (e.g., 'First, separate...', 'Next, place...')"], "common_pitfalls": ["Not clearly stating the new change", "Forgetting to describe the expected actions"], "model_answer_outline": "Identify the key change to the recycling program, such as new materials being accepted or new sorting rules. Explain what employees should do to comply with the change, mentioning any new steps or containers."}
{"id": "AG-EN-015", "scenario_id": "SCN-EN-015", "language": "EN", "expected_elements": ["Summary of the software update details", "Steps employees need to take to complete the update", "Any important dates or support resources"], "recommended_structures": ["Modal verbs for obligations (e.g., 'Employees should...', 'You must update...')", "Imperative sentences for step-by-step instructions"], "common_pitfalls": ["Missing key details about the update", "Not providing clear or complete instructions for employees"], "model_answer_outline": "Summarize what the software update involves, such as new features or security improvements. Clearly list the steps employees must follow to install or use the update, and mention any deadlines or help contacts."}
{"id": "AG-EN-016", "scenario_id": "SCN-EN-016", "language": "EN", "expected_elements": ["Description of the project with tight deadlines", "Steps taken to manage tasks and time", "Result of the actions taken"], "recommended_structures": ["Past tense for describing actions (e.g., 'I organized...')", "Sequencing words (e.g., 'First', 'Then', 'Finally')"], "common_pitfalls": ["Not mentioning specific actions taken", "Not linking actions to the outcome"], "model_answer_outline": "Describe a project you worked on with a challenging timeline. Explain how you prioritized tasks, organized your work, and communicated with your team. Conclude by mentioning how these steps helped you finish on time."}
{"id": "AG-EN-017", "scenario_id": "SCN-EN-017", "language": "EN", "expected_elements": ["Description of the unexpected problem", "Explanation of how the team worked to solve it", "Outcome or result of the solution"], "recommended_structures": ["Past continuous and simple past ('We were working when...')", "Describing teamwork and collaboration (e.g., 'We discussed...', 'We decided...')"], "common_pitfalls": ["Not explaining how the team responded", "Failing to mention the result"], "model_answer_outline": "Describe a situation where your team faced an unexpected problem at work. Explain how the team communicated, brainstormed options, and implemented a solution. Finish by stating the result of your actions."}
{"id": "AG-EN-018", "scenario_id": "SCN-EN-018", "language": "EN", "expected_elements": ["Brief description of the new policy", "Explanation of its impact on your work", "Description of its effect on colleagues"], "recommended_structures": ["Present and past tenses to compare before and after", "Cause and effect structures (e.g., 'As a result...')"], "common_pitfalls": ["Not describing the policy clearly", "Ignoring its impact on others"], "model_answer_outline": "Describe the new policy introduced in your workplace and what it changed. Explain how it affected your daily tasks and how your colleagues responded or adapted."}
{"id": "AG-EN-019", "scenario_id": "SCN-EN-019", "language": "EN", "expected_elements": ["Description of the hiring process steps", "Key factors considered when selecting a candidate", "Mention of collaboration or decision-making"], "recommended_structures": ["Passive voice for process steps (e.g., 'Applications were reviewed...')", "Listing and sequencing (e.g., 'First...', 'Next...')"], "common_pitfalls": ["Omitting important steps in the process", "Not explaining the reasoning behind candidate selection"], "model_answer_outline": "Walk through the main stages of the hiring process you participated in, such as posting the job, reviewing resumes, and interviews. Highlight key criteria used for selection, like experience or fit with the team, and mention how the final decision was made."}
{"id": "AG-EN-020", "scenario_id": "SCN-EN-020", "language": "EN", "expected_elements": ["Description of the service that needed improvement", "Actions taken by you and your team", "Result or outcome of the improvements"], "recommended_structures": ["Past tense for actions taken", "Problem-solution-result format"], "common_pitfalls": ["Not describing the initial problem", "Failing to mention the outcome of the improvements"], "model_answer_outline": "Explain a situation where you identified a need to improve a service for clients. Describe the steps you and your team took to make changes, and conclude with the results and any feedback received."}
{"id": "AG-EN-021", "scenario_id": "SCN-EN-021", "language": "EN", "expected_elements": ["Description of transition process steps", "Strategies to support team adaptation", "Actions taken to ensure continuity and minimize disruption"], "recommended_structures": ["Past tense narration", "Sequencing with connectors (first, then, after that, finally)", "Passive voice for processes"], "common_pitfalls": ["Omitting specific steps taken", "Lack of clarity about communication or training measures"], "model_answer_outline": "The answer should outline how the team planned the transition, provided necessary training, and communicated changes to all stakeholders. The learner should mention steps like testing the platform, offering support, and monitoring progress to resolve issues quickly."}
{"id": "AG-EN-022", "scenario_id": "SCN-EN-022", "language": "EN", "expected_elements": ["Overview of assessment steps (data collection, analysis, consultations)", "Summary of main findings", "Key recommendations provided"], "recommended_structures": ["Past tense for completed actions", "Passive voice (was conducted, were identified)", "Clear listing using bullet points or sequencing"], "common_pitfalls": ["Missing specific findings or recommendations", "Lack of detail about the assessment process"], "model_answer_outline": "The response should describe the assessment process, including data gathering and stakeholder consultations. The learner should summarize key findings, such as environmental risks, and present practical recommendations for mitigation."}
{"id": "AG-EN-023", "scenario_id": "SCN-EN-023", "language": "EN", "expected_elements": ["Explanation of communication methods used", "Approaches to clarify the change", "Actions to ensure acceptance and address concerns"], "recommended_structures": ["Past tense", "Use of reported speech (we explained that...)", "Conditional sentences (if staff had questions, we...)"], "common_pitfalls": ["Not specifying how communication was conducted", "Ignoring how to ensure understanding or acceptance"], "model_answer_outline": "The answer should detail how the team communicated the change through meetings and written updates, provided opportunities for questions, and addressed concerns to promote understanding and buy-in."}
{"id": "AG-EN-024", "scenario_id": "SCN-EN-024", "language": "EN", "expected_elements": ["Persuasive arguments supporting proposal", "Acknowledgement and addressing of colleague's concerns", "Demonstration of flexibility/compromise"], "recommended_structures": ["Conditional sentences (If you support..., then...)", "Persuasive modal verbs (could, should, would)", "Polite language for negotiation"], "common_pitfalls": ["Ignoring the colleague's perspective", "Overly assertive or dismissive tone"], "model_answer_outline": "The learner should explain how they would present the benefits of their proposal, listen to the colleague's concerns, and suggest adjustments or compromises to reach an agreement."}
{"id": "AG-EN-025", "scenario_id": "SCN-EN-025", "language": "EN", "expected_elements": ["Recognition of the committee's concerns", "Provision of evidence or risk mitigation strategies", "Clear, confident reassurance"], "recommended_structures": ["Conditional sentences (If approved, we will...)", "Modals for possibility and certainty (can, will, may)", "Persuasive expressions (I assure you, it is important to note...)"], "common_pitfalls": ["Dismissing concerns without addressing them", "Failing to provide concrete solutions"], "model_answer_outline": "The answer should acknowledge the risks, explain steps taken to mitigate them, and provide evidence or examples to reassure the committee and encourage approval."}
{"id": "AG-EN-026", "scenario_id": "SCN-EN-026", "language": "EN", "expected_elements": ["Explanation of the policy's benefits", "Addressing staff skepticism with facts or examples", "Invitation for questions or feedback"], "recommended_structures": ["Persuasive language (I believe, it is beneficial because...)", "Present and future tenses (This policy will...)", "Second conditional for hypothetical concerns"], "common_pitfalls": ["Ignoring skepticism", "Using only abstract benefits without examples"], "model_answer_outline": "The learner should outline the key benefits of the policy, provide relevant examples, address possible concerns, and invite staff to ask questions or discuss further."}
{"id": "AG-EN-027", "scenario_id": "SCN-EN-027", "language": "EN", "expected_elements": ["Description of mediation steps (listening, facilitating discussion)", "Maintaining impartiality and respect", "Focus on positive resolution and follow-up"], "recommended_structures": ["Sequencing (First, I would... Next... Finally...)", "Modal verbs for suggestions (should, could)", "Indirect language for sensitivity"], "common_pitfalls": ["Taking sides or assigning blame", "Skipping resolution or follow-up steps"], "model_answer_outline": "The answer should describe listening to both sides, facilitating open discussion, encouraging mutual understanding, and ensuring a respectful and lasting resolution."}
{"id": "AG-EN-028", "scenario_id": "SCN-EN-028", "language": "EN", "expected_elements": ["Acknowledgement of operational concerns", "Presentation of environmental benefits and possible solutions", "Use of evidence or examples to persuade"], "recommended_structures": ["Persuasive modal verbs (could, should, would)", "Conditional sentences (If we implement..., then...)", "Balanced arguments"], "common_pitfalls": ["Ignoring committee's concerns", "Focusing only on environmental aspects"], "model_answer_outline": "The learner should recognize operational challenges, explain the long-term benefits of environmental measures, and propose practical solutions or compromises supported by evidence."}
{"id": "AG-EN-029", "scenario_id": "SCN-EN-029", "language": "EN", "expected_elements": ["Strategies to clarify misunderstandings", "Encouragement of open communication", "Suggestions to prevent future issues"], "recommended_structures": ["Sequencing (First, I would... Then...)", "Modal verbs for suggestions (should, could)", "Indirect and diplomatic language"], "common_pitfalls": ["Not addressing root causes", "Overlooking preventive measures"], "model_answer_outline": "The answer should outline how to clarify confusion, encourage team members to express concerns, and propose strategies such as regular check-ins or clear documentation to prevent misunderstandings."}
{"id": "AG-EN-030", "scenario_id": "SCN-EN-030", "language": "EN", "expected_elements": ["Explanation of technology upgrade benefits", "Addressing management concerns (cost, disruption, ROI)", "Supporting arguments with data or examples"], "recommended_structures": ["Persuasive future tense (will improve, will reduce)", "Conditional sentences (If we invest..., then...)", "Use of statistics or case studies"], "common_pitfalls": ["Failing to address specific management concerns", "Lack of evidence or examples"], "model_answer_outline": "The learner should present clear benefits of the upgrade, respond to concerns about cost and disruption, and use evidence or examples to demonstrate the value of the investment."}
