{"id": "EC-FR-PHASE1", "phase": "1", "language": "FR", "name": "Mise en train — Questions factuelles", "level_target": "A", "duration_min": 5, "duration_max": 10, "objectives": ["Évaluer l'aisance dans les échanges courants", "Vérifier la maîtrise du vocabulaire de base et professionnel", "Observer la fluidité des réponses spontanées", "Déterminer si le candidat démontre les compétences de niveau A"], "description": "L'évaluateur commence par des questions simples et factuelles sur le travail quotidien, l'environnement professionnel, les responsabilités et le parcours. Cette phase met le candidat à l'aise et permet de vérifier les compétences de base (niveau A). L'examen se déroule en entrevue via MS Teams, caméra allumée.", "format_note": "L'examen oral SLE est une entrevue structurée continue de 20 à 40 minutes. Il n'y a pas de parties séparées — l'évaluateur guide la conversation et augmente progressivement la difficulté."}
{"id": "EC-EN-PHASE1", "phase": "1", "language": "EN", "name": "Warm-up — Factual questions", "level_target": "A", "duration_min": 5, "duration_max": 10, "objectives": ["Assess fluency in everyday exchanges", "Verify mastery of basic and professional vocabulary", "Observe spontaneity in responses", "Determine whether the candidate demonstrates A-level skills"], "description": "The assessor starts with simple, factual questions about daily work, professional environment, responsibilities and background. This phase puts the candidate at ease and verifies basic skills (Level A). The exam is conducted as an interview via MS Teams, camera on.", "format_note": "The SLE oral exam is a continuous structured interview lasting 20 to 40 minutes. There are no separate parts — the assessor guides the conversation and progressively increases difficulty."}
{"id": "EC-FR-PHASE2", "phase": "2", "language": "FR", "name": "Bloc explicatif et récit", "level_target": "B", "duration_min": 8, "duration_max": 15, "objectives": ["Évaluer la capacité à décrire des situations concrètes non routinières", "Vérifier l'utilisation du passé composé et de l'imparfait", "Observer la structure narrative (méthode STAR)", "Tester la capacité à expliquer et comparer"], "description": "L'évaluateur progresse vers des questions sur des situations concrètes non routinières : décrire un projet, raconter une expérience professionnelle, expliquer un problème résolu. Évalue la capacité narrative, la maîtrise des temps du passé et la structure du discours. Niveau visé : B.", "key_structures": ["Passé composé vs imparfait", "Connecteurs de séquence (d'abord, ensuite, enfin)", "Pronoms relatifs simples (qui, que)", "Conditionnel simple"]}
{"id": "EC-EN-PHASE2", "phase": "2", "language": "EN", "name": "Explanatory block and narrative", "level_target": "B", "duration_min": 8, "duration_max": 15, "objectives": ["Assess ability to describe concrete non-routine situations", "Verify use of past tenses and narrative structures", "Observe narrative structure (STAR method)", "Test ability to explain and compare"], "description": "The assessor progresses to questions about concrete non-routine situations: describing a project, recounting a professional experience, explaining a solved problem. Assesses narrative ability, mastery of past tenses and discourse structure. Target level: B.", "key_structures": ["Past simple vs past continuous", "Sequence connectors (first, then, finally)", "Simple relative clauses (who, which, that)", "Basic conditional"]}
{"id": "EC-FR-PHASE3", "phase": "3", "language": "FR", "name": "Opinion, analyse et hypothèses", "level_target": "C", "duration_min": 10, "duration_max": 15, "objectives": ["Évaluer la capacité d'argumentation structurée (méthode OPIC)", "Vérifier l'utilisation du subjonctif, conditionnel passé et plus-que-parfait", "Observer la maîtrise des connecteurs logiques complexes", "Tester la gestion de sujets abstraits et hypothétiques", "Évaluer la nuance et la concession"], "description": "L'évaluateur aborde des sujets complexes et abstraits : opinions sur des politiques, hypothèses, débats sur des enjeux professionnels. Évalue l'argumentation nuancée, la complexité syntaxique et la capacité à défendre une position. Niveau visé : C.", "key_structures": ["Subjonctif (il faut que, bien que, pour que)", "Conditionnel passé (j'aurais dû, il aurait fallu)", "Plus-que-parfait", "Voix passive", "Connecteurs avancés (néanmoins, en revanche, d'autant plus que, quoique)", "Hypothèses irréelles (si + plus-que-parfait → conditionnel passé)"]}
{"id": "EC-EN-PHASE3", "phase": "3", "language": "EN", "name": "Opinion, analysis and hypotheticals", "level_target": "C", "duration_min": 10, "duration_max": 15, "objectives": ["Assess structured argumentation ability (OPIC method)", "Verify use of subjunctive, third conditional and past perfect", "Observe mastery of complex logical connectors", "Test handling of abstract and hypothetical topics", "Assess nuance and concession"], "description": "The assessor moves to complex and abstract topics: opinions on policies, hypotheticals, debates on professional issues. Assesses nuanced argumentation, syntactic complexity and ability to defend a position. Target level: C.", "key_structures": ["Subjunctive mood (it is essential that, I recommend that)", "Third conditional (if I had known, I would have)", "Past perfect", "Complex passive voice", "Advanced connectors (nevertheless, furthermore, notwithstanding, albeit)", "Unreal hypotheticals (if + past perfect → would have + past participle)"]}
