{"id": "KB-EXAM-001", "category": "exam_structure", "language": "FR", "topic": "Format de l'examen oral SLE", "content": "L'examen oral de l'ÉLS est une entrevue structurée de 20 à 40 minutes via Teams. L'évaluateur pose des questions de difficulté progressive pour déterminer le niveau (A, B ou C). Phase 1 (5-10 min) : questions factuelles sur le travail (niveau A). Phase 2 (8-15 min) : récits, projets, problèmes résolus avec méthode STAR (niveau B). Phase 3 (10-15 min) : opinions, hypothèses, débats avec méthode OPIC (niveau C). Il n'y a pas de composante d'écoute ou de résumé.", "level": "ALL", "tags": ["exam", "structure", "format"]}
{"id": "KB-EXAM-002", "category": "exam_structure", "language": "EN", "topic": "SLE Oral Exam Format", "content": "The SLE oral exam is a structured interview of 20-40 minutes via Teams. The assessor asks progressively harder questions to determine the level (A, B, or C). Phase 1 (5-10 min): factual questions about work (Level A). Phase 2 (8-15 min): narratives, projects, problems solved using STAR method (Level B). Phase 3 (10-15 min): opinions, hypotheticals, debates using OPIC method (Level C). There is no listening or summarizing component.", "level": "ALL", "tags": ["exam", "structure", "format"]}
{"id": "KB-CRITERIA-001", "category": "evaluation_criteria", "language": "FR", "topic": "Les 7 critères CFP d'évaluation", "content": "Les 7 critères de la Commission de la fonction publique (CFP) pour l'évaluation orale SLE sont : 1) Fonctions langagières (capacité à accomplir des tâches communicatives). 2) Richesse lexicale (variété et précision du vocabulaire). 3) Complexité grammaticale (variété des structures). 4) Cohérence et cohésion (organisation logique du discours). 5) Nuance et précision (capacité à nuancer ses propos). 6) Interaction (capacité à maintenir une conversation). 7) Connecteurs logiques (utilisation de mots de liaison).", "level": "ALL", "tags": ["criteria", "CFP", "evaluation"]}
{"id": "KB-CRITERIA-002", "category": "evaluation_criteria", "language": "EN", "topic": "The 7 PSC Evaluation Criteria", "content": "The 7 Public Service Commission (PSC) criteria for the SLE oral evaluation are: 1) Language functions (ability to accomplish communicative tasks). 2) Lexical richness (vocabulary variety and precision). 3) Grammatical complexity (variety of structures). 4) Coherence and cohesion (logical organization of speech). 5) Nuance and precision (ability to qualify statements). 6) Interaction (ability to maintain a conversation). 7) Logical connectors (use of linking words).", "level": "ALL", "tags": ["criteria", "PSC", "evaluation"]}
{"id": "KB-LEVEL-A-FR", "category": "level_description", "language": "FR", "topic": "Caractéristiques du niveau A", "content": "Niveau A (Base) : Phrases simples (sujet-verbe-complément). Vocabulaire de base lié à la vie quotidienne et au travail. Temps de verbe : présent principalement. Réponses directes et factuelles. Peut comprendre et répondre à des questions simples posées lentement et clairement. Connecteurs très limités.", "level": "A", "tags": ["level", "A", "description"]}
{"id": "KB-LEVEL-B-FR", "category": "level_description", "language": "FR", "topic": "Caractéristiques du niveau B", "content": "Niveau B (Intermédiaire) : Structure narrative cohérente (introduction, développement, conclusion). Utilisation appropriée du passé composé et de l'imparfait. Vocabulaire plus précis et professionnel. Capacité à donner des détails et des exemples concrets. Connecteurs de base (ensuite, puis, parce que, donc). Peut maintenir une conversation sur des sujets familiers.", "level": "B", "tags": ["level", "B", "description"]}
{"id": "KB-LEVEL-C-FR", "category": "level_description", "language": "FR", "topic": "Caractéristiques du niveau C", "content": "Niveau C (Avancé) : Opinions structurées et nuancées. Utilisation du conditionnel pour les hypothèses. Vocabulaire riche et soutenu. Connecteurs logiques complexes (néanmoins, en revanche, par ailleurs). Capacité à faire des concessions et à synthétiser. Aisance dans l'abstraction et l'analyse. Maîtrise du subjonctif, conditionnel passé, voix passive.", "level": "C", "tags": ["level", "C", "description"]}
{"id": "KB-METHOD-STAR", "category": "methodology", "language": "FR", "topic": "La méthode STAR pour le récit (Niveau B)", "content": "La méthode S.T.A.R. structure un récit : S (Situation) = Décrivez le contexte, où et quand. T (Tâche) = Quel était votre rôle ou votre objectif. A (Action) = Quelles actions concrètes avez-vous prises. R (Résultat) = Quel a été le résultat, qu'avez-vous appris. Exemple : 'L'année dernière, mon ministère voulait améliorer la communication (S). J'ai été chargé de centraliser l'information (T). J'ai organisé des rencontres et révisé les textes (A). Le nombre de questions a diminué de 20% (R).'", "level": "B", "tags": ["STAR", "method", "narrative"]}
{"id": "KB-METHOD-STAR-EN", "category": "methodology", "language": "EN", "topic": "The STAR Method for Narratives (Level B)", "content": "The S.T.A.R. method structures a narrative: S (Situation) = Describe the context, where and when. T (Task) = What was your role or objective. A (Action) = What concrete actions did you take. R (Result) = What was the outcome, what did you learn. Example: 'Last year, my department wanted to improve communication (S). I was tasked with centralizing information (T). I organized meetings and revised texts (A). The number of inquiries dropped by 20% (R).'", "level": "B", "tags": ["STAR", "method", "narrative"]}
{"id": "KB-METHOD-OPIC", "category": "methodology", "language": "FR", "topic": "La méthode OPIC pour l'opinion nuancée (Niveau C)", "content": "La méthode O.P.I.C. structure une opinion nuancée : O (Opinion) = Énoncez clairement votre position. P (Pourquoi) = Justifiez avec des arguments solides. I (Illustration) = Donnez un exemple concret. C (Concession & Conclusion) = Reconnaissez un point de vue contraire, puis concluez. Exemple : 'À mon sens, l'IA est une opportunité (O). Elle peut automatiser les tâches répétitives (P). Dans mon domaine, un système pourrait trier les demandes (I). Bien entendu, il faut des balises éthiques, mais si nous abordons l'IA comme un outil, elle transformera positivement notre travail (C).'", "level": "C", "tags": ["OPIC", "method", "opinion"]}
{"id": "KB-METHOD-OPIC-EN", "category": "methodology", "language": "EN", "topic": "The OPIC Method for Nuanced Opinions (Level C)", "content": "The O.P.I.C. method structures a nuanced opinion: O (Opinion) = Clearly state your position. P (Pourquoi/Why) = Justify with solid arguments. I (Illustration) = Give a concrete example. C (Concession & Conclusion) = Acknowledge a counterpoint, then conclude. Example: 'In my view, AI is an opportunity (O). It can automate repetitive tasks (P). In my field, a system could sort requests (I). Of course, ethical safeguards are needed, but if we approach AI as a tool, it will positively transform our work (C).'", "level": "C", "tags": ["OPIC", "method", "opinion"]}
{"id": "KB-HYPOTHESIS-FR", "category": "grammar", "language": "FR", "topic": "Les 3 types d'hypothèses", "content": "1. Hypothèse réelle (présent/futur) : Si + Présent → Futur Simple. Exemple : 'Si nous investissons dans la formation, les résultats s'amélioreront.' 2. Hypothèse irréelle au présent : Si + Imparfait → Conditionnel Présent. Exemple : 'Si j'étais le ministre, j'investirais dans la technologie.' 3. Hypothèse irréelle au passé (regret) : Si + Plus-que-parfait → Conditionnel Passé. Exemple : 'Si j'avais eu plus de ressources, j'aurais embauché un expert supplémentaire.'", "level": "C", "tags": ["hypothesis", "conditional", "grammar"]}
{"id": "KB-HYPOTHESIS-EN", "category": "grammar", "language": "EN", "topic": "The 3 Types of Hypotheses", "content": "1. Real hypothesis (present/future): If + Present → Future. Example: 'If we invest in training, results will improve.' 2. Unreal present hypothesis: If + Past Simple → Would + Base. Example: 'If I were the minister, I would invest in technology.' 3. Unreal past hypothesis (regret): If + Past Perfect → Would Have + Past Participle. Example: 'If I had had more resources, I would have hired an additional expert.'", "level": "C", "tags": ["hypothesis", "conditional", "grammar"]}
{"id": "KB-CONNECTORS-FR", "category": "vocabulary", "language": "FR", "topic": "Les 50 connecteurs logiques essentiels", "content": "Addition : et, de plus, en outre, par ailleurs, également, de même, ainsi que. Cause : car, en effet, parce que, puisque, grâce à, à cause de, étant donné que, du fait que. Conséquence : donc, ainsi, par conséquent, c'est pourquoi, de ce fait, en conséquence, d'où. Opposition/Concession : mais, cependant, néanmoins, pourtant, en revanche, au contraire, bien que, même si, toutefois, malgré, en dépit de. But : pour, afin de, dans le but de, pour que, afin que. Temps : d'abord, ensuite, puis, finalement, pendant que, lorsque, avant de, après avoir, depuis que, dès que. Exemple : par exemple, notamment, ainsi, en particulier, à savoir. Synthèse : en bref, en somme, pour conclure, en résumé, finalement, en définitive, tout bien considéré.", "level": "ALL", "tags": ["connectors", "vocabulary", "linking_words"]}
{"id": "KB-CONNECTORS-EN", "category": "vocabulary", "language": "EN", "topic": "Essential Logical Connectors", "content": "Addition: moreover, furthermore, in addition, also, as well as. Cause: because, since, due to, given that, as a result of. Consequence: therefore, thus, consequently, as a result, hence. Opposition/Concession: however, nevertheless, nonetheless, yet, on the other hand, despite, although, even though. Purpose: in order to, so that, with the aim of. Time: first, then, next, finally, while, when, before, after. Example: for example, for instance, such as, in particular. Synthesis: in short, in summary, to conclude, all things considered, ultimately.", "level": "ALL", "tags": ["connectors", "vocabulary", "linking_words"]}
{"id": "KB-PHRASES-FR", "category": "model_phrases", "language": "FR", "topic": "Modèles de phrases prêts à l'emploi", "content": "Pour commencer une réponse : 'En ce qui concerne…', 'Pour répondre à votre question…', 'C'est un sujet intéressant…', 'Abordons la question de…'. Pour structurer un récit : 'Tout a commencé lorsque…', 'La première étape a été de…', 'Par la suite…', 'Finalement…', 'Pour vous donner un peu de contexte…'. Pour donner une opinion : 'À mon avis…', 'Selon moi…', 'Je suis convaincu que…', 'Il me semble que…', 'De mon point de vue…'. Pour nuancer : 'D'un côté…, de l'autre côté…', 'Il faut reconnaître que…', 'Cela dit…', 'Bien que…', 'Il convient de nuancer…'. Pour hypothétiser : 'Si j'avais le choix, je…', 'En supposant que…', 'Imaginons un instant que…'. Pour conclure : 'En somme…', 'Pour conclure…', 'En résumé…', 'Tout bien considéré…'.", "level": "ALL", "tags": ["phrases", "templates", "speaking"]}
{"id": "KB-PHRASES-EN", "category": "model_phrases", "language": "EN", "topic": "Ready-to-use Model Phrases", "content": "To start a response: 'Regarding…', 'To answer your question…', 'That's an interesting topic…', 'Let me address…'. To structure a narrative: 'It all started when…', 'The first step was to…', 'Subsequently…', 'Finally…', 'To give you some context…'. To give an opinion: 'In my opinion…', 'I believe that…', 'I'm convinced that…', 'It seems to me that…', 'From my perspective…'. To nuance: 'On one hand…, on the other hand…', 'It must be acknowledged that…', 'That said…', 'Although…'. To hypothesize: 'If I had the choice, I would…', 'Assuming that…', 'Let's imagine for a moment that…'. To conclude: 'In short…', 'To conclude…', 'In summary…', 'All things considered…'.", "level": "ALL", "tags": ["phrases", "templates", "speaking"]}
{"id": "KB-VOCAB-PROJECT-FR", "category": "vocabulary", "language": "FR", "topic": "Vocabulaire thématique : Gestion de projet", "content": "Noms : un jalon, une échéance, un livrable, un budget, une partie prenante, un risque, un enjeu, une portée, un calendrier, une étape clé. Verbes : planifier, coordonner, mettre en œuvre, suivre, évaluer, rendre compte, déléguer, allouer, prioriser, superviser. Adjectifs : réalisable, ambitieux, stratégique, interfonctionnel, agile, prioritaire, mesurable.", "level": "B", "tags": ["vocabulary", "project_management"]}
{"id": "KB-VOCAB-HR-FR", "category": "vocabulary", "language": "FR", "topic": "Vocabulaire thématique : Ressources humaines", "content": "Noms : la dotation, le recrutement, l'accueil et l'intégration, la gestion de la performance, le perfectionnement professionnel, la rétention, la mobilisation, l'évaluation, la classification. Verbes : embaucher, former, encadrer, évaluer, promouvoir, retenir, motiver, accompagner, développer. Adjectifs : compétent, qualifié, motivé, engagé, inclusif, diversifié, performant.", "level": "B", "tags": ["vocabulary", "human_resources"]}
{"id": "KB-VOCAB-COMM-FR", "category": "vocabulary", "language": "FR", "topic": "Vocabulaire thématique : Communication", "content": "Noms : une note de breffage, un compte rendu, une présentation, une consultation, une rétroaction, la transparence, un communiqué, un rapport, une directive. Verbes : communiquer, informer, consulter, négocier, persuader, clarifier, synthétiser, vulgariser, diffuser. Adjectifs : clair, concis, transparent, diplomatique, constructif, stratégique, accessible.", "level": "B", "tags": ["vocabulary", "communication"]}
{"id": "KB-GRAMMAR-PC-IMP-FR", "category": "grammar", "language": "FR", "topic": "Passé composé vs Imparfait", "content": "Le passé composé s'utilise pour une action ponctuelle terminée dans le passé : 'Hier, j'ai terminé mon rapport.' L'imparfait s'utilise pour une description, une habitude ou une action en cours dans le passé : 'Quand j'étais plus jeune, je jouais au tennis tous les samedis.' Astuce : si l'action a un début et une fin clairs = passé composé. Si c'est un contexte, une ambiance, une habitude = imparfait. Erreur fréquente : 'Quand j'ai été jeune, j'ai joué au soccer' → Correction : 'Quand j'étais jeune, je jouais au soccer.'", "level": "B", "tags": ["grammar", "past_tenses"]}
{"id": "KB-GRAMMAR-COND-FR", "category": "grammar", "language": "FR", "topic": "Le conditionnel présent et passé", "content": "Conditionnel présent : radical du futur + terminaisons de l'imparfait (-ais, -ais, -ait, -ions, -iez, -aient). Usage : hypothèse irréelle au présent, souhait, suggestion, politesse. Exemple : 'Si j'avais le temps, j'irais au cinéma.' Conditionnel passé : auxiliaire être/avoir au conditionnel + participe passé. Usage : hypothèse irréelle au passé, regret, reproche. Exemple : 'Si j'avais su, je serais venu plus tôt.'", "level": "C", "tags": ["grammar", "conditional"]}
{"id": "KB-GRAMMAR-SUBJ-FR", "category": "grammar", "language": "FR", "topic": "Le subjonctif présent", "content": "Le subjonctif s'utilise après des verbes exprimant la volonté (vouloir que, souhaiter que), l'émotion (être content que, regretter que), le doute (douter que, ne pas penser que), la nécessité (il faut que, il est nécessaire que). Exemples : 'Il faut que vous fassiez attention.' 'Je ne pense pas qu'il ait raison.' 'Il est important que nous prenions cette décision ensemble.'", "level": "C", "tags": ["grammar", "subjunctive"]}
{"id": "KB-ERROR-ANGLICISMS-FR", "category": "common_errors", "language": "FR", "topic": "Anglicismes fréquents à éviter", "content": "1. 'Je suis confortable avec cette idée' → 'Je suis à l'aise avec cette idée.' 2. 'Je vais assumer que c'est correct' → 'Je vais supposer que c'est correct.' (Assumer = prendre sur soi, accepter la responsabilité.) 3. 'Je suis responsable pour ce projet' → 'Je suis responsable de ce projet.' 4. 'Il est un bon gestionnaire' → 'C'est un bon gestionnaire.' (On utilise 'c'est' devant un nom précédé d'un déterminant.) 5. 'Adresser un problème' → 'Aborder/traiter un problème.' 6. 'Appliquer pour un poste' → 'Postuler à un poste.'", "level": "ALL", "tags": ["errors", "anglicisms"]}
{"id": "KB-STRATEGY-WARMUP", "category": "strategy", "language": "FR", "topic": "Stratégies pour la mise en train (Phase 1)", "content": "1. Restez simple et direct : des phrases courtes et claires sont plus efficaces. 2. Donnez des réponses complètes : évitez les réponses d'un seul mot. Ajoutez toujours un ou deux éléments d'information. 3. Préparez votre vocabulaire : révisez le vocabulaire lié à votre travail, vos tâches, votre équipe. 4. Soyez prêt à donner des exemples : même pour des questions simples, un petit exemple concret enrichit votre réponse.", "level": "A", "tags": ["strategy", "warmup", "phase1"]}
{"id": "KB-STRATEGY-NARRATIVE", "category": "strategy", "language": "FR", "topic": "Stratégies pour le récit (Phase 2)", "content": "1. Utilisez la méthode STAR systématiquement. 2. Maîtrisez le passé composé et l'imparfait. 3. Préparez 3-4 histoires professionnelles à l'avance. 4. Utilisez des connecteurs temporels : d'abord, ensuite, puis, finalement. 5. Donnez des résultats quantifiables quand possible. 6. Montrez ce que vous avez appris de l'expérience.", "level": "B", "tags": ["strategy", "narrative", "phase2"]}
{"id": "KB-STRATEGY-OPINION", "category": "strategy", "language": "FR", "topic": "Stratégies pour l'opinion et l'analyse (Phase 3)", "content": "1. Utilisez la méthode OPIC systématiquement. 2. Commencez toujours par votre opinion claire. 3. Faites toujours une concession (montrez que vous voyez les deux côtés). 4. Utilisez le conditionnel pour les hypothèses. 5. Employez des connecteurs avancés : néanmoins, en revanche, bien que. 6. Préparez des exemples concrets pour illustrer vos arguments.", "level": "C", "tags": ["strategy", "opinion", "phase3"]}
{"id": "KB-STRESS-MGMT", "category": "strategy", "language": "FR", "topic": "Gestion du stress et du temps pendant l'examen", "content": "1. Respirez profondément avant de répondre — prenez 2-3 secondes pour organiser vos idées. 2. Si vous ne comprenez pas une question, demandez de la répéter : 'Pourriez-vous répéter la question, s'il vous plaît?' 3. Si vous ne connaissez pas un mot, reformulez : 'Ce que je veux dire, c'est que…' 4. Ne vous excusez pas pour votre niveau — concentrez-vous sur la communication. 5. Pensez en français, ne traduisez pas de l'anglais. 6. Si vous faites une erreur, corrigez-vous naturellement et continuez.", "level": "ALL", "tags": ["stress", "tips", "exam_day"]}
{"id": "KB-CHECKLIST", "category": "strategy", "language": "FR", "topic": "Checklist finale avant l'examen", "content": "Vérifiez que vous : 1. Connaissez les compétences attendues pour votre niveau cible. 2. Maîtrisez la méthode STAR pour raconter une histoire. 3. Maîtrisez la méthode OPIC pour donner une opinion nuancée. 4. Pouvez identifier et utiliser les 3 types d'hypothèses. 5. Avez préparé des exemples concrets liés à votre travail. 6. Avez révisé le vocabulaire clé de votre domaine professionnel. 7. Vous êtes entraîné à répondre à des questions à voix haute. 8. Connaissez une stratégie pour gérer votre stress.", "level": "ALL", "tags": ["checklist", "preparation"]}
{"id": "KB-CURRICULUM-PATHS", "category": "curriculum", "language": "FR", "topic": "Les 6 parcours (Paths) de RusingAcademy", "content": "Path I (A1/SLE A) : Foundations — Acquérir les bases de la communication en milieu de travail. Path II (A2/SLE A) : Everyday Communication — Gérer les interactions quotidiennes simples. Path III (B1/SLE B) : Professional Interactions — Participer activement à des discussions professionnelles. Path IV (B2/SLE B) : Strategic Communication — Communiquer avec nuance, persuasion et efficacité. Path V (C1/SLE C) : Advanced Proficiency — Maîtriser des communications complexes et exigeantes. Path VI (A2-C1/SLE A,B,C) : SLE Mastery — Préparation intensive et stratégique aux tests SLE.", "level": "ALL", "tags": ["curriculum", "paths", "RusingAcademy"]}
{"id": "KB-GRAMMAR-PC-IMP-EN", "category": "grammar", "language": "EN", "topic": "Past Simple vs Present Perfect", "content": "Past Simple: for completed actions at a specific time in the past. 'Yesterday, I finished my report.' Present Perfect: for actions with a connection to the present, or when the time is not specified. 'I have finished my report (it's done now).' Common error: 'I have finished it yesterday' → 'I finished it yesterday.' Use Past Simple with specific time markers (yesterday, last week, in 2020). Use Present Perfect with 'already', 'yet', 'ever', 'never', 'since', 'for'.", "level": "B", "tags": ["grammar", "past_tenses"]}
{"id": "KB-GRAMMAR-COND-EN", "category": "grammar", "language": "EN", "topic": "Conditionals in English", "content": "First conditional (real future): If + Present → Will + Base. 'If we invest in training, results will improve.' Second conditional (unreal present): If + Past Simple → Would + Base. 'If I were the minister, I would invest in technology.' Third conditional (unreal past): If + Past Perfect → Would Have + Past Participle. 'If I had had more resources, I would have hired an expert.' Mixed conditional: If + Past Perfect → Would + Base. 'If I had studied harder, I would be more confident now.'", "level": "C", "tags": ["grammar", "conditional"]}
{"id": "KB-LEARNING-TIPS-FR", "category": "learning_tips", "language": "FR", "topic": "Conseils pour améliorer son français", "content": "1. Pratiquez 15-20 minutes par jour plutôt que 2 heures une fois par semaine. 2. Écoutez des podcasts en français pendant vos déplacements. 3. Lisez des articles de Radio-Canada ou Le Devoir. 4. Parlez à voix haute — même seul — pour développer la fluidité. 5. Tenez un journal en français de 5 phrases par jour. 6. Regardez des séries québécoises ou françaises avec sous-titres français. 7. Utilisez des applications comme Lingueefy pour la pratique quotidienne. 8. Trouvez un partenaire de conversation ou un coach.", "level": "ALL", "tags": ["learning", "tips", "practice"]}
{"id": "KB-LEARNING-TIPS-EN", "category": "learning_tips", "language": "EN", "topic": "Tips to Improve Your English", "content": "1. Practice 15-20 minutes daily rather than 2 hours once a week. 2. Listen to English podcasts during your commute. 3. Read articles from CBC or The Globe and Mail. 4. Speak out loud — even alone — to build fluency. 5. Keep a daily journal of 5 sentences in English. 6. Watch English TV shows with English subtitles. 7. Use apps like Lingueefy for daily practice. 8. Find a conversation partner or coach.", "level": "ALL", "tags": ["learning", "tips", "practice"]}
{"id": "KB-CONFIDENCE-FR", "category": "motivation", "language": "FR", "topic": "Construire la confiance linguistique", "content": "La confiance est aussi importante que la compétence. Rappelez-vous : 1. L'évaluateur n'est pas là pour vous piéger — il veut voir ce que vous pouvez faire. 2. Les erreurs sont normales et attendues — même les locuteurs natifs font des erreurs. 3. L'auto-correction est valorisée — si vous corrigez une erreur, c'est un signe de compétence. 4. La fluidité compte plus que la perfection — mieux vaut parler avec quelques erreurs que de ne pas parler du tout. 5. Votre expérience professionnelle est votre meilleur atout — utilisez-la dans vos exemples.", "level": "ALL", "tags": ["confidence", "motivation", "mindset"]}
{"id": "KB-VOCAB-ABSTRACT-FR", "category": "vocabulary", "language": "FR", "topic": "Vocabulaire abstrait pour le niveau C", "content": "Noms : un enjeu, une problématique, une perspective, un paradigme, une approche, un cadre conceptuel, une dynamique, une synergie, un levier, une piste de réflexion. Verbes : analyser, évaluer, synthétiser, nuancer, conceptualiser, contextualiser, prioriser, optimiser, préconiser. Adjectifs : stratégique, systémique, transversal, holistique, pragmatique, novateur, durable, inclusif. Expressions : 'il convient de souligner que', 'force est de constater que', 'il va sans dire que', 'à la lumière de', 'dans cette optique'.", "level": "C", "tags": ["vocabulary", "abstract", "advanced"]}
{"id": "KB-THEME-LEADERSHIP-FR", "category": "thematic_questions", "language": "FR", "topic": "Questions thématiques : Leadership et Gestion", "content": "1. Quelles sont les trois qualités les plus importantes d'un bon leader dans la fonction publique? 2. Comment motivez-vous une équipe démotivée? 3. Si vous pouviez changer une chose dans la culture de gestion de votre ministère, que changeriez-vous? 4. Est-il plus important pour un gestionnaire d'être un expert ou d'avoir d'excellentes compétences interpersonnelles? 5. Comment gérez-vous la performance d'un employé qui ne répond pas aux attentes?", "level": "C", "tags": ["questions", "leadership", "management"]}
{"id": "KB-THEME-CHANGE-FR", "category": "thematic_questions", "language": "FR", "topic": "Questions thématiques : Gestion du changement", "content": "1. Quel est le plus grand obstacle à l'innovation dans la fonction publique? 2. Comment convaincriez-vous des employés résistants au changement? 3. L'intelligence artificielle est-elle une menace ou une opportunité pour la fonction publique? 4. Si vous aviez un budget illimité pour l'innovation, que feriez-vous? 5. La fonction publique est-elle trop averse au risque?", "level": "C", "tags": ["questions", "change_management", "innovation"]}
{"id": "KB-THEME-WORKLIFE-FR", "category": "thematic_questions", "language": "FR", "topic": "Questions thématiques : Équilibre travail-vie", "content": "1. Le télétravail a-t-il eu un impact positif ou négatif sur la productivité? 2. Quelles mesures votre organisation pourrait-elle mettre en place pour le bien-être des employés? 3. Le modèle hybride est-il la solution d'avenir ou un compromis temporaire? 4. Comment maintenir une culture d'équipe forte en télétravail? 5. Le droit à la déconnexion est-il respecté dans votre environnement?", "level": "C", "tags": ["questions", "work_life_balance", "remote_work"]}
{"id": "KB-THEME-CAREER-FR", "category": "thematic_questions", "language": "FR", "topic": "Questions thématiques : Dotation et carrière", "content": "1. Le processus de dotation est-il trop lent et bureaucratique? 2. Est-il préférable d'être spécialiste ou généraliste pour progresser? 3. Comment la fonction publique peut-elle attirer et retenir les jeunes talents? 4. Si vous étiez responsable de la formation, sur quelles compétences mettriez-vous l'accent? 5. La sécurité d'emploi est-elle toujours le principal avantage du gouvernement?", "level": "C", "tags": ["questions", "staffing", "career"]}
{"id": "KB-THEME-SOCIETY-FR", "category": "thematic_questions", "language": "FR", "topic": "Questions thématiques : Enjeux de société", "content": "1. Quel est le plus grand défi auquel le Canada sera confronté dans les dix prochaines années? 2. Comment le gouvernement peut-il mieux communiquer à l'ère des fausses nouvelles? 3. Le bilinguisme est-il un atout ou un fardeau pour la fonction publique? 4. Quel rôle le gouvernement devrait-il jouer pour lutter contre les changements climatiques? 5. La diversité et l'inclusion sont-elles suffisamment intégrées dans les pratiques?", "level": "C", "tags": ["questions", "society", "government"]}
{"id": "KB-MODEL-ANSWER-A", "category": "model_answers", "language": "FR", "topic": "Exemple de réponse modèle niveau A", "content": "Question : 'Parlez-moi de votre travail.' Réponse niveau A : 'Je suis analyste. Je travaille pour le gouvernement. Je lis des documents et j'écris des courriels.' Pourquoi ça fonctionne : La réponse est simple, factuelle et utilise des phrases courtes. Le vocabulaire est courant et la grammaire est correcte. Elle répond directement à la question.", "level": "A", "tags": ["model_answer", "example"]}
{"id": "KB-MODEL-ANSWER-B", "category": "model_answers", "language": "FR", "topic": "Exemple de réponse modèle niveau B (STAR)", "content": "Question : 'Racontez-moi un projet dont vous êtes fier.' Réponse niveau B (STAR) : '(S) L'année dernière, mon ministère voulait améliorer la communication. L'information était dispersée. (T) J'ai été chargé de centraliser l'information sur le site web. (A) D'abord, j'ai organisé des rencontres. Ensuite, j'ai travaillé avec l'équipe web. J'ai aussi révisé les textes. (R) Le nombre de questions a diminué de 20%. J'étais vraiment fier de l'impact.' Analyse : Structure STAR claire, passé composé/imparfait corrects, vocabulaire professionnel, connecteurs temporels.", "level": "B", "tags": ["model_answer", "STAR", "example"]}
{"id": "KB-MODEL-ANSWER-C", "category": "model_answers", "language": "FR", "topic": "Exemple de réponse modèle niveau C (OPIC)", "content": "Question : 'L'IA est-elle une menace ou une opportunité pour la fonction publique?' Réponse niveau C (OPIC) : '(O) À mon sens, l'IA représente fondamentalement une opportunité majeure, à condition que son intégration soit gérée de manière stratégique et éthique. (P) L'IA a le potentiel d'automatiser des tâches répétitives, ce qui libérerait les fonctionnaires pour des dossiers plus complexes. (I) Dans mon domaine, un système d'IA pourrait trier les milliers de demandes que nous recevons. (C) Bien entendu, il faut des balises éthiques solides. En somme, si nous abordons l'IA comme un outil au service de l'humain, elle pourrait transformer positivement notre façon de travailler.' Analyse : Structure OPIC, vocabulaire riche, conditionnel, concession bien menée.", "level": "C", "tags": ["model_answer", "OPIC", "example"]}
