{"levelId":"X","descriptionFr":"Performance insuffisante. Résultat inférieur au niveau A. Indique un besoin de remédiation fondamentale (grammaire de base, conjugaison élémentaire).","descriptionEn":"Insufficient performance. Below Level A. Indicates a need for fundamental remediation (basic grammar, elementary conjugation).","minScoreReading":0,"minScoreWriting":0,"minScoreOral":0,"passThreshold":0,"sustainedPerformanceWindow":5,"oralComplexityRubric":{"syntaxExpected":"Fragments, incomplete sentences","discourseMarkers":[],"registerLevel":"N/A","cognitiveComplexity":"Unable to sustain basic communication"}}
{"levelId":"A","descriptionFr":"Débutant. Concrétude et routine. Le candidat peut traiter des questions simples et répétitives. Vocabulaire limité aux champs sémantiques immédiats (temps, lieu, personne). Syntaxe directe (Sujet-Verbe-Objet).","descriptionEn":"Beginner. Concrete and routine. The candidate can handle simple, repetitive questions. Vocabulary limited to immediate semantic fields (time, place, person). Direct syntax (Subject-Verb-Object).","minScoreReading":18,"minScoreWriting":20,"minScoreOral":36,"passThreshold":36,"sustainedPerformanceWindow":5,"oralComplexityRubric":{"syntaxExpected":"Simple SVO sentences, present tense dominant, basic questions","discourseMarkers":["et","mais","parce que","aussi"],"registerLevel":"Informal acceptable, tu/vous inconsistent","cognitiveComplexity":"Concrete, factual, routine workplace topics"}}
{"levelId":"B","descriptionFr":"Intermédiaire. Narration et faits. C'est le niveau « pivot ». Le candidat maîtrise la narration au passé et la description factuelle. Capacité à distinguer l'idée principale des détails secondaires et à enchaîner des idées concrètes.","descriptionEn":"Intermediate. Narration and facts. This is the 'pivot' level. The candidate masters past narration and factual description. Ability to distinguish main ideas from secondary details and chain concrete ideas.","minScoreReading":28,"minScoreWriting":31,"minScoreOral":55,"passThreshold":55,"sustainedPerformanceWindow":5,"oralComplexityRubric":{"syntaxExpected":"Passé composé vs imparfait, relative clauses, conditional simple, comparative structures","discourseMarkers":["d'abord","ensuite","cependant","par contre","en fait","par exemple"],"registerLevel":"Consistent vous in professional context, semi-formal register","cognitiveComplexity":"Narration, explanation, comparison, factual opinion with justification"}}
{"levelId":"C","descriptionFr":"Avancé. Abstraction et nuance. Le niveau de la gestion et de la stratégie. Le candidat doit manipuler des concepts hypothétiques, persuader et négocier. Utilisation de connecteurs logiques complexes et du subjonctif/conditionnel. Introduction de « friction » (désaccords, ambiguïté).","descriptionEn":"Advanced. Abstraction and nuance. The management and strategy level. The candidate must manipulate hypothetical concepts, persuade and negotiate. Use of complex logical connectors and subjunctive/conditional. Introduction of 'friction' (disagreements, ambiguity).","minScoreReading":38,"minScoreWriting":43,"minScoreOral":75,"passThreshold":75,"sustainedPerformanceWindow":5,"oralComplexityRubric":{"syntaxExpected":"Subjonctif, conditionnel passé, plus-que-parfait, passive voice, concessive structures (bien que, quoique), hypothetical chains (si + plus-que-parfait → conditionnel passé)","discourseMarkers":["en l'occurrence","force est de constater","il n'en demeure pas moins","en revanche","néanmoins","quoi qu'il en soit","à cet égard","dans cette optique"],"registerLevel":"Formal diplomatic register, consistent vous, ability to modulate tone","cognitiveComplexity":"Abstract reasoning, hypothesis, persuasion, negotiation, nuance, friction management, leadership competencies"}}
{"levelId":"E","descriptionFr":"Exemption. Maîtrise quasi-native. Le candidat opère avec une aisance totale, sans erreurs récurrentes. Débits de parole rapides et textes d'une grande densité idiomatique.","descriptionEn":"Exemption. Near-native mastery. The candidate operates with total ease, without recurring errors. Rapid speech rate and texts with high idiomatic density.","minScoreReading":45,"minScoreWriting":52,"minScoreOral":90,"passThreshold":90,"sustainedPerformanceWindow":5,"oralComplexityRubric":{"syntaxExpected":"All structures with native-like accuracy, idiomatic expressions, proverbs, cultural references","discourseMarkers":["toujours est-il que","soit dit en passant","à plus forte raison","en tout état de cause"],"registerLevel":"Full register control — can shift seamlessly between formal, semi-formal, and colloquial","cognitiveComplexity":"Unrestricted — can handle any topic with sophistication and cultural sensitivity"}}
